Revit 2027 API
Category.IsCuttable Property
Indicates if the category is cuttable or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCuttable { get; }
Public ReadOnly Property IsCuttable As Boolean
	Get
public:
property bool IsCuttable {
	bool get ();
}
member IsCuttable : bool with get
Property Value
Boolean
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace